Ac6Embedded/svd-microchip/PIC32CZ_CA70/PIC32CZ1038CA70064.svd
            <register>
               <name>US_CSR_USART_MODE</name>
               <description>Channel Status Register</description>
               <addressOffset>0x0014</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXRDY</name>
                     <description>Receiver Ready (cleared by reading US_RHR)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXRDY</name>
                     <description>Transmitter Ready (cleared by writing US_THR)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBRK</name>
                     <description>Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE</name>
                     <description>Overrun Error (cleared by writing a one to bit US_CR.RSTSTA)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRAME</name>
                     <description>Framing Error (cleared by writing a one to bit US_CR.RSTSTA)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARE</name>
                     <description>Parity Error (cleared by writing a one to bit US_CR.RSTSTA)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMEOUT</name>
                     <description>Receiver Timeout (cleared by writing a one to bit US_CR.STTTO)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>Transmitter Empty (cleared by writing US_THR)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ITER</name>
                     <description>Max Number of Repetitions Reached (cleared by writing a one to bit US_CR.RSTIT)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NACK</name>
                     <description>Non Acknowledge Interrupt (cleared by writing a one to bit US_CR.RSTNACK)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RIIC</name>
                     <description>Ring Indicator Input Change Flag (cleared on read)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSRIC</name>
                     <description>Data Set Ready Input Change Flag (cleared on read)</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCDIC</name>
                     <description>Data Carrier Detect Input Change Flag (cleared on read)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTSIC</name>
                     <description>Clear to Send Input Change Flag (cleared on read)</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RI</name>
                     <description>Image of RI Input</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DSR</name>
                     <description>Image of DSR Input</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCD</name>
                     <description>Image of DCD Input</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTS</name>
                     <description>Image of CTS Input</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MANERR</name>
                     <description>Manchester Error (cleared by writing a one to the bit US_CR.RSTSTA)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_CSR_SPI_MODE</name>
               <description>Channel Status Register</description>
               <alternateRegister>US_CSR_USART_MODE</alternateRegister>
               <addressOffset>0x0014</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXRDY</name>
                     <description>Receiver Ready (cleared by reading US_RHR)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXRDY</name>
                     <description>Transmitter Ready (cleared by writing US_THR)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE</name>
                     <description>Overrun Error (cleared by writing a one to bit US_CR.RSTSTA)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>Transmitter Empty (cleared by writing US_THR)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNRE</name>
                     <description>SPI Underrun Error</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NSSE</name>
                     <description>NSS Line (Driving CTS Pin) Rising or Falling Edge Event</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NSS</name>
                     <description>Image of NSS Line</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_CSR_LIN_MODE</name>
               <description>Channel Status Register</description>
               <alternateRegister>US_CSR_USART_MODE</alternateRegister>
               <addressOffset>0x0014</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXRDY</name>
                     <description>Receiver Ready (cleared by reading US_RHR)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXRDY</name>
                     <description>Transmitter Ready (cleared by writing US_THR)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE</name>
                     <description>Overrun Error (cleared by writing a one to bit US_CR.RSTSTA)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRAME</name>
                     <description>Framing Error (cleared by writing a one to bit US_CR.RSTSTA)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARE</name>
                     <description>Parity Error (cleared by writing a one to bit US_CR.RSTSTA)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMEOUT</name>
                     <description>Receiver Timeout (cleared by writing a one to bit US_CR.STTTO)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>Transmitter Empty (cleared by writing US_THR)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINBK</name>
                     <description>LIN Break Sent or LIN Break Received</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINID</name>
                     <description>LIN Identifier Sent or LIN Identifier Received</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINTC</name>
                     <description>LIN Transfer Completed</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINBLS</name>
                     <description>LIN Bus Line Status</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINBE</name>
                     <description>LIN Bus Error</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINISFE</name>
                     <description>LIN Inconsistent Synch Field Error</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINIPE</name>
                     <description>LIN Identifier Parity Error</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINCE</name>
                     <description>LIN Checksum Error</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINSNRE</name>
                     <description>LIN Slave Not Responding Error Interrupt Mask</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINSTE</name>
                     <description>LIN Synch Tolerance Error</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINHTE</name>
                     <description>LIN Header Timeout Error</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_CSR_LON_MODE</name>
               <description>Channel Status Register</description>
               <alternateRegister>US_CSR_USART_MODE</alternateRegister>
               <addressOffset>0x0014</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXRDY</name>
                     <description>Receiver Ready (cleared by reading US_RHR)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXRDY</name>
                     <description>Transmitter Ready (cleared by writing US_THR)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE</name>
                     <description>Overrun Error (cleared by writing a one to bit US_CR.RSTSTA)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LSFE</name>
                     <description>LON Short Frame Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCRCE</name>
                     <description>LON CRC Error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>Transmitter Empty (cleared by writing US_THR)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UNRE</name>
                     <description>Underrun Error</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LTXD</name>
                     <description>LON Transmission End Flag</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LCOL</name>
                     <description>LON Collision Detected Flag</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LFET</name>
                     <description>LON Frame Early Termination</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LRXD</name>
                     <description>LON Reception End Flag</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LBLOVFE</name>
                     <description>LON Backlog Overflow Error</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_RHR</name>
               <description>Receive Holding Register</description>
               <addressOffset>0x0018</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXCHR</name>
                     <description>Received Character</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>RXSYNH</name>
                     <description>Received Sync</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_THR</name>
               <description>Transmit Holding Register</description>
               <addressOffset>0x001C</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TXCHR</name>
                     <description>Character to be Transmitted</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>TXSYNH</name>
                     <description>Sync Field to be Transmitted</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_BRGR</name>
               <description>Baud Rate Generator Register</description>
               <addressOffset>0x0020</addressOffset>
               <fields>
                  <field>
                     <name>CD</name>
                     <description>Clock Divider</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>FP</name>
                     <description>Fractional Part</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_RTOR</name>
               <description>Receiver Timeout Register</description>
               <addressOffset>0x0024</addressOffset>
               <fields>
                  <field>
                     <name>TO</name>
                     <description>Timeout Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>17</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_TTGR_USART_MODE</name>
               <description>Transmitter Timeguard Register</description>
               <addressOffset>0x0028</addressOffset>
               <fields>
                  <field>
                     <name>TG</name>
                     <description>Timeguard Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_TTGR_LON_MODE</name>
               <description>Transmitter Timeguard Register</description>
               <alternateRegister>US_TTGR_USART_MODE</alternateRegister>
               <addressOffset>0x0028</addressOffset>
               <fields>
                  <field>
                     <name>PCYCLE</name>
                     <description>LON PCYCLE Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_FIDI_USART_MODE</name>
               <description>FI DI Ratio Register</description>
               <addressOffset>0x0040</addressOffset>
               <fields>
                  <field>
                     <name>FI_DI_RATIO</name>
                     <description>FI Over DI Ratio Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_FIDI_LON_MODE</name>
               <description>FI DI Ratio Register</description>
               <alternateRegister>US_FIDI_USART_MODE</alternateRegister>
               <addressOffset>0x0040</addressOffset>
               <fields>
                  <field>
                     <name>BETA2</name>
                     <description>LON BETA2 Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_NER</name>
               <description>Number of Errors Register</description>
               <addressOffset>0x0044</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NB_ERRORS</name>
                     <description>Number of Errors</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>US_IF</name>
               <description>IrDA Filter Register</description>
               <addressOffset>0x004C</addressOffset>
               <fields>
                  <field>
                     <name>IRDA_FILTER</name>
                     <description>IrDA Filter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
